# Exploratory Data Analysis

In [15]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
df_art = pd.read_csv('articles_2017_08.csv')
df_com = pd.read_csv('comments_2017_08.csv')

Let's have a first look at the data.

In [14]:
df_art.head(3)

,tId,article_id,updated,num_comments,link,header,sub,text
0,30600370,30600370,1.502015e+09,12,/leben/reisen/story/Fuenf-Gruende-fuer-eine-Re...,Fünf Gründe für eine Reise nach Alabama,Sweet Home Alabama! Der Staat im Südosten der ...,"Feinste Sandstrände, kilometerlange Maisfelder..."
1,11684042,11684042,1.502015e+09,4,/ausland/news/story/Lopez-aus-Gefaengnis-in-Ha...,Lopez aus Gefängnis in Hausarrest entlassen,Vier Tage nach seiner Festnahme befindet sich ...,Vier Tage nach seiner Festnahme ist der venezo...
2,29297244,29297244,1.502015e+09,39,/sport/weitere/story/29297244,Buhmann Gatlin holt Gold – Bolt wird gefeiert,Usain Bolt muss auf seine 12. WM-Goldmedaille ...,(sr/fal/sda)

In [12]:
df_com.head(3)

,tId,cId,mob,vup,vdo,tit,aut,time,con
0,30284249,329_485,1,5,2,@Rebby,Störenfried,am 06.08.2017 08:59,"Wäre doch machbar, Störsender in Autos einzub..."
1,25420673,1_37,1,0,0,@T. Paul,Papa Bär,am 05.08.2017 22:02,Hier. Aber ich bin ja nur ein Papa Bär. Hüte ...
2,30284249,47_47,1,39,7,Das liebe Handy...,Heinz,am 05.08.2017 19:00,Und dazu brauchts ne Studie? Legt im allgemei...

In [16]:
print(df_art.shape)
print(df_com.shape)

(21, 8)
(1307, 9)

In [18]:
print(df_art.dtypes)
print(' ')
print(df_com.dtypes)

tId               int64
article_id        int64
updated         float64
num_comments      int64
link             object
header           object
sub              object
text             object
dtype: object

tId      int64
cId     object
mob      int64
vup      int64
vdo      int64
tit     object
aut     object
time    object
con     object
dtype: object

In [20]:
df_art.describe()

# Summary:
# No missing attributes since count is the same everywhere
# No negative values, chi^2 etc. can be used

                tId    article_id       updated  num_comments
count  2.100000e+01  2.100000e+01  2.100000e+01     21.000000
mean   2.199326e+07  2.199326e+07  1.502015e+09     63.238095
std    6.324191e+06  6.324191e+06  8.011205e+00     94.626056
min    1.168404e+07  1.168404e+07  1.502015e+09      0.000000
25%    1.590470e+07  1.590470e+07  1.502015e+09      6.000000
50%    2.210167e+07  2.210167e+07  1.502015e+09     16.000000
75%    2.662436e+07  2.662436e+07  1.502015e+09     39.000000
max    3.071505e+07  3.071505e+07  1.502015e+09    296.000000

In [22]:
df_com.describe()

# Summary:
# No missing attributes 
# No negative values

                tId          mob          vup          vdo
count  1.307000e+03  1307.000000  1307.000000  1307.000000
mean   1.986452e+07     0.744453    39.846213    19.492731
std    6.589672e+06     0.436335    69.444030    35.611812
min    1.168404e+07     0.000000     0.000000     0.000000
25%    1.394283e+07     0.000000     8.000000     3.000000
50%    1.942335e+07     1.000000    22.000000     8.000000
75%    2.542067e+07     1.000000    46.500000    18.000000
max    3.071505e+07     1.000000   969.000000   316.000000